### 1

In [3]:
import pandas as pd
l=[4, 8, 15, 16, 23, 42]
my_series=pd.Series(l)
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### 2

In [4]:
import pandas as pd
l=[i for i in range(1,11)]
data=pd.Series(l)
print(data)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### 3

In [6]:
import pandas as pd
df=pd.DataFrame({
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
})

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### 4

In pandas, a **DataFrame** and a **Series** are two fundamental data structures for handling and manipulating data, but they serve different purposes and have distinct characteristics.

**DataFrame:**
- A DataFrame is a 2-dimensional labeled data structure, similar to a spreadsheet or SQL table. It consists of rows and columns, where each column can contain different data types (e.g., integers, floats, strings, etc.).
- It is essentially a collection of Series objects, with each column being a Series.
- DataFrames are used to store and work with structured data, such as data loaded from CSV files, Excel spreadsheets, or database tables.
- DataFrames are typically used for handling tabular data where you have multiple variables (columns) for each observation (row).

In [13]:
import pandas as pd
df=pd.DataFrame({
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female


**Series:**
- A Series, on the other hand, is a one-dimensional labeled array that can contain data of any data type (e.g., integers, floats, strings).
- Series objects are more like arrays or lists in Python but with an associated label (index), which allows for more convenient and meaningful data manipulation.
- They are often used for handling single columns of data or for representing a single dimension of data within a DataFrame.

In [15]:
import pandas as pd
l=[i for i in range(1,11)]
data=pd.Series(l)
print(data)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### 5

Common Functions which are used to manipulate the data in pandas dataframe:
- loc[] and iloc[]
- merge()
- sort_values()
- groupby()
- fillna()
-  drop()

In [25]:
import pandas as pd
df=pd.DataFrame({
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
})

In [26]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
df.iloc[1]

Name       Bob
Age         30
Gender    Male
Name: 1, dtype: object

In [28]:
df.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

### 6

In pandas, a **Series** is mutable, while a **DataFrame** and a **Panel** (which has been deprecated) are not.

1. **Series (Mutable):** A Series is mutable because you can change its values or modify it after it has been created. You can reassign values to specific elements in a Series or use methods like `.loc[]` to modify elements based on their labels. This mutability is because a Series is essentially a one-dimensional array with labeled indices, and arrays in Python are mutable.


2. **DataFrame (Immutable):** A DataFrame is generally considered immutable because you typically cannot change its structure directly after creation. If you want to make changes to a DataFrame, such as adding or removing columns, you usually create a new DataFrame with the desired modifications based on the existing one. This immutability is to ensure data integrity and prevent unintended side effects when working with tabular data.

   

3. **Panel (Deprecated):** Panels were a 3-dimensional data structure in older versions of pandas but have been deprecated in recent versions (since version 0.25.0). They were also considered immutable, and their use has been discouraged in favor of using MultiIndex DataFrames to handle multi-dimensional data.

### 7

In [31]:
import pandas as pd
a=['Alice','Bob','Claire','Tony','Steve']
b=[25,30,27,45,35]
c=['Hyderabad','Banglore','Chennai','Hyderabad','Mumbai']
a=pd.Series(a)
b=pd.Series(b)
c=pd.Series(c)
df=pd.DataFrame({
   'Name':a,
    'Age':b,
    'Address':c
})

In [32]:
df

     Name  Age    Address
0   Alice   25  Hyderabad
1     Bob   30   Banglore
2  Claire   27    Chennai
3    Tony   45  Hyderabad
4   Steve   35     Mumbai